{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "time_distributed_7_input"}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_7", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10, 224, 224, 3], "layer": {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_8", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 222, 222, 64]}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_9", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_10", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 109, 109, 128]}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_11", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_12", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 52, 52, 256]}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_13", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 26, 26, 256]}}}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 9.999999747378752e-05, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of85.bin", "group1-shard2of85.bin", "group1-shard3of85.bin", "group1-shard4of85.bin", "group1-shard5of85.bin", "group1-shard6of85.bin", "group1-shard7of85.bin", "group1-shard8of85.bin", "group1-shard9of85.bin", "group1-shard10of85.bin", "group1-shard11of85.bin", "group1-shard12of85.bin", "group1-shard13of85.bin", "group1-shard14of85.bin", "group1-shard15of85.bin", "group1-shard16of85.bin", "group1-shard17of85.bin", "group1-shard18of85.bin", "group1-shard19of85.bin", "group1-shard20of85.bin", "group1-shard21of85.bin", "group1-shard22of85.bin", "group1-shard23of85.bin", "group1-shard24of85.bin", "group1-shard25of85.bin", "group1-shard26of85.bin", "group1-shard27of85.bin", "group1-shard28of85.bin", "group1-shard29of85.bin", "group1-shard30of85.bin", "group1-shard31of85.bin", "group1-shard32of85.bin", "group1-shard33of85.bin", "group1-shard34of85.bin", "group1-shard35of85.bin", "group1-shard36of85.bin", "group1-shard37of85.bin", "group1-shard38of85.bin", "group1-shard39of85.bin", "group1-shard40of85.bin", "group1-shard41of85.bin", "group1-shard42of85.bin", "group1-shard43of85.bin", "group1-shard44of85.bin", "group1-shard45of85.bin", "group1-shard46of85.bin", "group1-shard47of85.bin", "group1-shard48of85.bin", "group1-shard49of85.bin", "group1-shard50of85.bin", "group1-shard51of85.bin", "group1-shard52of85.bin", "group1-shard53of85.bin", "group1-shard54of85.bin", "group1-shard55of85.bin", "group1-shard56of85.bin", "group1-shard57of85.bin", "group1-shard58of85.bin", "group1-shard59of85.bin", "group1-shard60of85.bin", "group1-shard61of85.bin", "group1-shard62of85.bin", "group1-shard63of85.bin", "group1-shard64of85.bin", "group1-shard65of85.bin", "group1-shard66of85.bin", "group1-shard67of85.bin", "group1-shard68of85.bin", "group1-shard69of85.bin", "group1-shard70of85.bin", "group1-shard71of85.bin", "group1-shard72of85.bin", "group1-shard73of85.bin", "group1-shard74of85.bin", "group1-shard75of85.bin", "group1-shard76of85.bin", "group1-shard77of85.bin", "group1-shard78of85.bin", "group1-shard79of85.bin", "group1-shard80of85.bin", "group1-shard81of85.bin", "group1-shard82of85.bin", "group1-shard83of85.bin", "group1-shard84of85.bin", "group1-shard85of85.bin"], "weights": [{"name": "dense_1/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}, {"name": "lstm_2/lstm_cell/kernel", "shape": [173056, 512], "dtype": "float32"}, {"name": "lstm_2/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_2/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_3/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "lstm_3/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm_3/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed_11/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "time_distributed_11/bias", "shape": [256], "dtype": "float32"}, {"name": "time_distributed_7/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "time_distributed_7/bias", "shape": [64], "dtype": "float32"}, {"name": "time_distributed_9/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "time_distributed_9/bias", "shape": [128], "dtype": "float32"}]}]}